src/test/resources/requests/weather/headerNotClosed.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://www.codecentric.de/namespace/weatherservice/general">
   <soapenv:Header>
   <soapenv:Body>
      <gen:doesnotmatter/>
   </soapenv:Body>
</soapenv:Envelope>